TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиПриемкаПЛКПоТочкамМаршрута/гкс_НастройкиПриемкаПЛКПоТочкамМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_НастройкиПриемкаПЛКПоТочкамМаршрута</name>
  <resources>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтарыйСтатус</name>
    <type>
      <types>EnumRef.гкс_СтатусыЭлектроннойОчереди</types>
    </type>
  </resources>
  <resources>
    <name>НовыйСтатус</name>
    <type>
      <types>EnumRef.гкс_СтатусыЭлектроннойОчереди</types>
    </type>
  </resources>
  <resources>
    <name>ПутьКДокументамСАРА</name>
    <comment>ERP-1605</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользуютсяЭлектронныеТабло</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеДопустимогоОтклоненияБрутто</name>
    <comment>ERP-2051</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеФормированиеДокументов</name>
    <comment>ERP-2240</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВариантИспользованияТаблоЭлектроннойОчереди</name>
    <type>
      <types>EnumRef.гкс_ВариантыИспользованияТаблоЭлектроннойОчереди</types>
    </type>
  </resources>
  <resources>
    <name>НормативПогрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УказыватьПричинуПревышенияНормативаПогрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ВариантыИспользованияТаблоЭлектроннойОчереди/гкс_ВариантыИспользованияТаблоЭлектроннойОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ВариантыИспользованияТаблоЭлектроннойОчереди</name>
  <comment>ERP-2673</comment>
  <enumValues>
    <name>ОтборПоНоменклатуре</name>
    <comment>Табло используется для определенной номенклатуры.</comment>
  </enumValues>
  <enumValues>
    <name>БезОтбора</name>
    <comment>Табло используется для всей принимаемой номенклатуры</comment>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_НастройкиПриемкаПЛКПоТочкамМаршрута/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВсеНастройкиТочкиМаршрута(ТочкаМаршрута) Экспорт
	
	НастройкиПоУмолчанию = СтруктураНастроек();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаВсеНастройкиТочкиМаршрута();
	
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(НастройкиПоУмолчанию, Выборка);
	КонецЕсли;
	
	Возврат НастройкиПоУмолчанию;
	
КонецФункции

// Возвращает установленное в настройках для ПЛК время ожидания ТС
//
// Параметры:
//  ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - точка маршрута для которой получаем параметр
//
// Возвращаемое значение:
//   число - количество минут
//
Функция ВремяОжиданияТранспортногоСредства(ТочкаМаршрута) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПриемкиПЛК.ВремяОжидания КАК ВремяОжидания
	|ИЗ
	|	РегистрСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута КАК НастройкиПриемкиПЛК
	|ГДЕ
	|	НастройкиПриемкиПЛК.ТочкаМаршрута = &ТочкаМаршрута";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
	    Результат = Выборка.ВремяОжидания;
	Иначе	
		Результат = 0;
	КонецЕсли;
	
	Возврат Результат; 
	
КонецФункции    

// Возвращает НормативПогрузки
//
// Параметры:
//  ТочкаМаршрута - СправочникСсылка.гкс_ТочкиМаршрута - точка маршрута для которой получаем параметр
//
// Возвращаемое значение:
//   число - количество минут
//
Функция НормативОтгрузки(ТочкаМаршрута) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПриемкиПЛК.НормативПогрузки КАК НормативПогрузки
	|ИЗ
	|	РегистрСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута КАК НастройкиПриемкиПЛК
	|ГДЕ
	|	НастройкиПриемкиПЛК.ТочкаМаршрута = &ТочкаМаршрута
	|	И НастройкиПриемкиПЛК.НормативПогрузки <> 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Норматив = 0;
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Норматив = Выборка.НормативПогрузки;
	КонецЕсли;
	
	Возврат Норматив;
	
КонецФункции

Функция ИспользуетсяЭлектронноеТабло(ТочкаМаршрута) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	1 КАК Результат
	|ИЗ
	|	РегистрСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута КАК ТаблицаНастроек
	|ГДЕ
	|	ТаблицаНастроек.ТочкаМаршрута = &ТочкаМаршрута
	|	И ТаблицаНастроек.ИспользуютсяЭлектронныеТабло";
	
	Возврат НЕ Запрос.Выполнить().Пустой();
		
КонецФункции

// Возвращает варианты использования электронного табло
//
// Параметры:
//  ТочкаМаршрута	 - СправочникСсылка.гкс_ТочкиМаршрута - точка маршрута
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.гкс_ВариантыИспользованияТаблоЭлектроннойОчереди -  вариант, указанный в настройках
//		Если в настройках вариант не указан возвращается вариант = ОтборПоНоменклатуре
//
Функция ПолучитьВариантИспользованияТаблоЭлектроннойОчереди(ТочкаМаршрута) Экспорт
	
	Результат = Перечисления.гкс_ВариантыИспользованияТаблоЭлектроннойОчереди.ОтборПоНоменклатуре;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТочкаМаршрута", ТочкаМаршрута);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаНастроек.ВариантИспользованияТаблоЭлектроннойОчереди КАК Результат
	|ИЗ
	|	РегистрСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута КАК ТаблицаНастроек
	|ГДЕ
	|	ТаблицаНастроек.ТочкаМаршрута = &ТочкаМаршрута";

	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = ?(ЗначениеЗаполнено(Выборка.Результат), Выборка.Результат, Результат);
	КонецЦикла;
	
	Возврат Результат;
		
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураНастроек()
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("ВремяОжидания");
	СтруктураНастроек.Вставить("СтарыйСтатус");
	СтруктураНастроек.Вставить("НовыйСтатус");
	СтруктураНастроек.Вставить("ПутьКДокументамСАРА");
	СтруктураНастроек.Вставить("ИспользуютсяЭлектронныеТабло");
	СтруктураНастроек.Вставить("ЗначениеДопустимогоОтклоненияБрутто");
	СтруктураНастроек.Вставить("АвтоматическоеФормированиеДокументов");
	СтруктураНастроек.Вставить("ВариантИспользованияТаблоЭлектроннойОчереди");
	СтруктураНастроек.Вставить("НормативПогрузки");	
	СтруктураНастроек.Вставить("УказыватьПричинуПревышенияНормативаПогрузки");
	
	Возврат СтруктураНастроек;
	
КонецФункции

#Область ТекстыЗапросов

Функция ТекстЗапросаВсеНастройкиТочкиМаршрута()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.ВремяОжидания КАК ВремяОжидания,
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.СтарыйСтатус КАК СтарыйСтатус,
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.НовыйСтатус КАК НовыйСтатус,
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.ПутьКДокументамСАРА КАК ПутьКДокументамСАРА,
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.ИспользуютсяЭлектронныеТабло КАК ИспользуютсяЭлектронныеТабло,
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.ЗначениеДопустимогоОтклоненияБрутто КАК ЗначениеДопустимогоОтклоненияБрутто,
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.АвтоматическоеФормированиеДокументов КАК АвтоматическоеФормированиеДокументов,
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.ВариантИспользованияТаблоЭлектроннойОчереди КАК ВариантИспользованияТаблоЭлектроннойОчереди,
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.НормативПогрузки КАК НормативПогрузки,
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.УказыватьПричинуПревышенияНормативаПогрузки КАК УказыватьПричинуПревышенияНормативаПогрузки
	|ИЗ
	|	РегистрСведений.гкс_НастройкиПриемкаПЛКПоТочкамМаршрута КАК НастройкиПриемкаПЛКПоТочкамМаршрута
	|ГДЕ
	|	НастройкиПриемкаПЛКПоТочкамМаршрута.ТочкаМаршрута = &ТочкаМаршрута";

	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
